from astarC import AStar
if __name__ == '__main__':
    maze = [[0, 1, 0, 0, 0, 1, 0, 0, 0, 0],
            [0, 1, 0, 1, 0, 1, 0, 1, 1, 0],
            [0, 1, 0, 1, 0, 1, 0, 1, 0, 0],
            [0, 1, 0, 1, 0, 1, 0, 1, 0, 1],
            [0, 1, 0, 1, 0, 1, 0, 1, 0, 0],
            [0, 1, 0, 1, 0, 1, 0, 1, 1, 0],
            [0, 1, 0, 1, 0, 1, 0, 1, 0, 0],
            [0, 1, 0, 1, 0, 1, 0, 1, 0, 1],
            [0, 1, 0, 1, 0, 1, 0, 1, 0, 0],
            [0, 0, 0, 1, 0, 0, 0, 1, 0, 0]]

    start = [0, 0]  # начальная позиция
    end = [9, 9]  # конечная точка
    cost = 1  # стоимость движения

    path = AStar.search(None, maze, cost, start, end)

    print('\n'.join([''.join(["{:" ">3d}".format(item) for item in row]) for row in path]))